import os
from faker import Faker

faker_ru = Faker(locale="ru")
faker_en = Faker(locale="en")
cur_dir = os.path.abspath(os.getcwd()) + "/data"
COUNT = 1000

POSTS_AGE = [12, 14, 16, 18, 21]
TYPIES = ["Публичные(открытые) акционерные общества (OAO)",
          "Частные(закрытые) акционерные общества (ЗАО)",
          "Дочернее общество",
          "Общество с ограниченной отвественностью (ООО)",
          "Кабусики-гайся",
          "Холдинговые акционерные общества",
          "Корпорация",
          "Ассоциация",
          "Унитарное предприятие"]
type_platform = ["стационарные", "гибридные", "портативные"]
COMPANY = []
URL_STEAM = "https://store.steampowered.com/api/appdetails?appids="

spheres = [
    "Разработка програмного обеспечения",
    "Индустрия компьютерных игр",
    "Киноиндустрия",
    "Бытовая электроника",
    "СМИ",
    "Информационные технологии",
    "Дистрибутор сетевого и телекоммуникационного оборудования",
    "Антивирусное программное обеспечение",
    "Розничная торговля",
    "Массовое онлайн-образование"]

types_con = ["игровая консоль",
             "домашная консоль",
             "портативная консоль",
             "гибридная консоль",
             "стационарная консоль",
             "периферийное устройство"]

type_game = ["game",
             "demo",
             "advertising",
             "mod"
             "movie"]